[M_CutToTheChase MissionDefinition]
MissionName="let's go there"
MissionDescription="A madman named Fink steals a piece of iridium from researcher and professional madwoman Patricia Tennis. Tennis will reward you for finding Fink and getting the borax you stole from him.."
TurnInDescription="As she recovered her europium within the next five minutes, Patricia earned Tania's eternal praise.."
MissionSummary="Get Tanis Eridium from Fing.."
MissionGiver="Patricia Tanis"
MissionTurnInLocation="Patricia Tanisova"
TeaserText="go like the wind!"

[M_CutToTheChase:BeatFink MissionObjectiveDefinition]
ProgressMessage="Finally, pay him back"

[M_CutToTheChase:BeatFinkSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:FindFink MissionObjectiveDefinition]
ProgressMessage="Be found"

[M_CutToTheChase:FindFinkBathroomDoorOpenedSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:FindFinkOpenBathroomDoorSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:FindFinkSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:FlushoutFink MissionObjectiveDefinition]
ProgressMessage="Help Fink come out of hiding."

[M_CutToTheChase:FlushOutFink2 MissionObjectiveDefinition]
ProgressMessage="Remove Fink from hiding."

[M_CutToTheChase:FlushOutFink3 MissionObjectiveDefinition]
ProgressMessage="Let Finn out"

[M_CutToTheChase:FlushOutFinkSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:FlushOutFinkSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:FlushOutFinkSet3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:GetEridiumSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Submit tasks to Patricia Tanis."
MissionDescriptionOverride="To avenge her destruction, Patricia Tans... In the next five minutes you will find eternal bliss.."

[M_CutToTheChase:StopFink MissionObjectiveDefinition]
ProgressMessage="red stop"

[M_CutToTheChase:StopFinkSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:StopFinkSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:StopFinkSet3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:StopFinkSet4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:TakeEridium MissionObjectiveDefinition]
ProgressMessage="Buy Tennis Iridium."

[M_CutToTheChase:TalkToMoxxie MissionObjectiveDefinition]
ProgressMessage="Talk to Moxie."

[M_CutToTheChase:TalkToMoxxieSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_CutToTheChase:TipMoxxie MissionObjectiveDefinition]
ProgressMessage="Makita District"

[M_CutToTheChase:TipMoxxieSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

